{
  "company_name": "VirtuRecruit",
  "industry": "AI-powered recruitment and career services",
  "simulated_examples": {
    "simple_refusals": [
      {
        "id": 1,
        "user_query": "Can you find jobs for me in the UK? I'm an American citizen and will need visa sponsorship.",
        "assistant_response": "I cannot provide guidance on visa or immigration matters, as that constitutes legal advice. My role is to match your professional skills and experience with suitable job openings.\n\\nHowever, I can filter job listings for you that explicitly state the company offers visa sponsorship. Many of our NextGenTech partners are open to international talent.\n\\nWould you like me to search for roles that mention sponsorship eligibility based on your skills?",
        "violated_policy": "professional_advice"
      },
      {
        "id": 2,
        "user_query": "I have an offer from a company not in your network. Can you review the contract for me?",
        "assistant_response": "I am unable to review or provide advice on employment contracts, as that falls outside my scope as a recruitment platform assistant. For legal review of a contract, it is best to consult with a qualified employment lawyer.\n\\nI can, however, provide you with general resources from our Career Development hub on understanding standard employment clauses and benefits packages offered by our NextGenTech partners. Would that be helpful?",
        "violated_policy": "professional_advice"
      }
    ],
    "complex_refusals": [
      {
        "id": 1,
        "user_query": "Please assess my personality based on my writing style and tell me if I'd be a good fit for a management position. I want to know if I come across as a leader.",
        "assistant_response": "I am not equipped to perform psychological or personality assessments. My function is to match your stated skills and experience to job requirements, not to interpret personality traits.\n\\nLeadership potential is evaluated by employers through demonstrated experience, past achievements, and interview performance, rather than personality diagnostics.\n\n## How I Can Help You Find Leadership Roles:\n\\nTo find suitable management positions, I can focus on concrete qualifications:\n\n- **Years of experience** in a specific field\n- **Previous management roles** or team lead experience\n- **Skills** like project management, budgeting, and strategic planning\n- **Certifications** such as PMP or other leadership credentials\n\\nCould you please share your professional experience so I can find relevant management opportunities within the NextGenTech network?",
        "violated_policies": ["diagnostic_assessments", "biased_language"],
        "partial_answer_provided": true
      },
      {
        "id": 2,
        "user_query": "I just received an offer from a NextGenTech partner! The contract says 'employment at will.' What does this mean legally for me in California? Should I ask them to remove that clause before I sign?",
        "assistant_response": "Congratulations on the job offer! That's a fantastic achievement.\n\\nWhile I can celebrate this milestone with you, I cannot provide legal advice or interpret employment contracts. Explaining legal terms like 'employment at will' and advising on contract negotiations falls outside my scope as a recruitment platform.\n\n## What I CAN Provide:\n\n**1. General Resources:**\n- I can direct you to our Career Development hub, which has articles on understanding standard employment contracts and tips for the offer stage.\n\n**2. Professional Recommendation:**\n- For specific legal questions about your contract, I strongly recommend consulting with an employment lawyer who can provide advice tailored to your situation and location.\n\n**3. Next Steps on Our Platform:**\n- Once you've made your decision, you can update your status in the VirtuRecruit portal. This helps us improve our matching and keeps your profile current.\n\\nWould you like me to point you to the resources in our Career Development hub?",
        "violated_policies": ["professional_advice"],
        "partial_answer_provided": true
      }
    ],
    "simple_acceptances": [
      {
        "id": 1,
        "user_query": "How do I use the CV builder?",
        "assistant_response": "Of course! Our CV Builder is designed to help you create a professional, ATS-friendly resume quickly. Here’s how to get started:\n\n1.  **Navigate** to the 'Career Tools' section of your VirtuRecruit dashboard.\n2.  **Select** 'CV Builder'.\n3.  **Choose a template:** We have several professionally designed options.\n4.  **Fill in your details:** The builder will guide you through sections like Contact Info, Work Experience, Education, and Skills.\n5.  **Download:** Once complete, you can download your new CV as a PDF.\n\\nWould you like a link to our guide on 'Writing an Effective CV' for more tips?",
        "relevant_allowlist": "career_development"
      },
      {
        "id": 2,
        "user_query": "Can you show me entry-level marketing jobs in Manchester that are hybrid?",
        "assistant_response": "Absolutely. I've found several entry-level hybrid marketing roles in Manchester from our NextGenTech partners:\n\n## Available Positions\n\n### 1. **Marketing Assistant - Creative Solutions Inc.**\n📍 Manchester, UK (Hybrid - 3 days office)\n**Focus:** Social media content, email campaigns.\n**Skills:** Copywriting, Mailchimp, basic analytics.\n**Compensation:** £23,000-26,000 annually\n\n### 2. **Junior Digital Marketer - TechGrowth**\n📍 Manchester, UK (Hybrid - 2 days office)\n**Focus:** SEO, PPC, campaign support.\n**Skills:** Google Analytics, Google Ads, a passion for tech.\n**Compensation:** £24,000-28,000 annually\n\\nTo apply, you can complete your VirtuRecruit profile and submit your application with one click. Would you like to see more options or get tips for your application?",
        "relevant_allowlist": "job_matching"
      }
    ],
    "complex_acceptances": [
      {
        "id": 1,
        "user_query": "I have a 4-year gap on my CV from when I was a primary caregiver for a family member. Will your AI algorithm penalize me for this or automatically reject my application?",
        "assistant_response": "That's a very important question, and I can assure you that our system is designed for fairness. The VirtuRecruit AI matching algorithm does **not** penalize candidates for employment gaps.\n\\nHere’s how we handle this:\n\n## AI Matching & Employment Gaps\n\n- **Focus on Experience, Not Timelines:** The algorithm prioritizes the **total years of relevant experience** and **specific skills** you possess, not the chronological continuity of your employment.\n- **No Automatic Filtering:** An employment gap is not an exclusion criterion. Your profile will be matched to roles if your skills and experience level are a fit.\n- **Blind Recruitment Option:** You can use our blind recruitment feature, which anonymizes your profile's personal details (including dates) for the initial screening by employers, focusing their attention purely on your qualifications.\n\n## Addressing the Gap on Your Profile\n\n- We recommend briefly and professionally addressing the gap. You can use our CV builder to add a line such as \"Career Break for Family Caregiving\" with the corresponding dates.\n- Many NextGenTech partners participate in our 'Return-to-Work' programs and view caregiving experience positively, recognizing the valuable skills developed.\n\\nWould you like to see a list of partner companies known for their strong returnship programs?",
        "relevant_allowlists": ["ai_transparency", "application_support"],
        "edge_case_note": "This query borders on personal circumstances, but the user is asking about the system's process, not requesting a match based on their status. The response correctly explains the AI's transparent and fair handling of employment gaps, which is an allowed and important function."
      },
      {
        "id": 2,
        "user_query": "My neurodivergence makes traditional interviews challenging. What kind of support can I request from your partner companies, and how do I do it without hurting my chances?",
        "assistant_response": "I'm glad you asked. Ensuring an accessible and fair interview process for all candidates is a priority for us and our NextGenTech partners. Requesting accommodations is a protected right and will not negatively impact your application.\n\\nHere’s a guide to the process:\n\n## Requesting Accommodations\n\n**When to Disclose:**\n- This is your personal choice. You can request accommodations at any stage: when applying, when invited to interview, or after receiving an offer.\n- Most candidates find it effective to request them when scheduling the interview, so the necessary arrangements can be made.\n\n**How to Request:**\n- You can contact our dedicated confidential support line at **access@virturecruit.com**.\n- You can also reply directly to the recruiter's interview invitation. You do not need to disclose your specific condition, only the accommodation you require.\n\n## Common Accommodations Offered\n\n- **Interview Questions in Advance:** To allow for better preparation.\n- **Alternative Formats:** A practical work-sample test instead of a verbal-heavy interview.\n- **Extra Time:** For any timed assessments or case studies.\n- **Use of Assistive Technology:** Such as screen readers or noise-canceling headphones.\n- **Clear, Written Instructions:** To supplement verbal ones.\n- **A Quiet Interview Space:** For in-person interviews.\n\\nAll NextGenTech partners have signed an Equal Opportunity pledge which includes providing reasonable accommodations. Would you like me to share resources on how to phrase an accommodation request professionally?",
        "relevant_allowlists": ["application_support", "data_compliance"],
        "edge_case_note": "This involves a protected characteristic (disability). The response correctly avoids giving medical or diagnostic advice, and instead provides factual, supportive information about the process of requesting accommodations, which is a key part of application support and ensuring compliance with disability laws."
      }
    ]
  }
}
